; domain
(define (domain sokoban)
 (:requirements :strips :typing)
 (:types player box position)
 (:predicates
  (player-at ?p - player ?pos - position)
  (box-at ?b - box ?pos - position)
  (goal ?b - box ?pos - position)
  (empty ?pos - position)
  (adj-up ?f ?t - position)
  (adj-down ?f ?t - position)
  (adj-left ?f ?t - position)
  (adj-right ?f ?t - position)
 )
 (:action move
  :parameters (?p - player ?f ?t - position)
  :precondition (and (player-at ?p ?f) (empty ?t)
    (or (adj-up ?f ?t)(adj-down ?f ?t)(adj-left ?f ?t)(adj-right ?f ?t)))
  :effect (and (not (player-at ?p ?f)) (player-at ?p ?t) (empty ?f) (not (empty ?t)))
 )
 (:action push-up
  :parameters (?p - player ?b - box ?f ?t ?n - position)
  :precondition (and (player-at ?p ?f)(box-at ?b ?t)(adj-up ?f ?t)(adj-up ?t ?n)(empty ?n))
  :effect (and (player-at ?p ?t)(not (player-at ?p ?f))(box-at ?b ?n)(not (box-at ?b ?t))(empty ?f)(not (empty ?n)))
 )
 (:action push-down
  :parameters (?p - player ?b - box ?f ?t ?n - position)
  :precondition (and (player-at ?p ?f)(box-at ?b ?t)(adj-down ?f ?t)(adj-down ?t ?n)(empty ?n))
  :effect (and (player-at ?p ?t)(not (player-at ?p ?f))(box-at ?b ?n)(not (box-at ?b ?t))(empty ?f)(not (empty ?n)))
 )
 (:action push-left
  :parameters (?p - player ?b - box ?f ?t ?n - position)
  :precondition (and (player-at ?p ?f)(box-at ?b ?t)(adj-left ?f ?t)(adj-left ?t ?n)(empty ?n))
  :effect (and (player-at ?p ?t)(not (player-at ?p ?f))(box-at ?b ?n)(not (box-at ?b ?t))(empty ?f)(not (empty ?n)))
 )
 (:action push-right
  :parameters (?p - player ?b - box ?f ?t ?n - position)
  :precondition (and (player-at ?p ?f)(box-at ?b ?t)(adj-right ?f ?t)(adj-right ?t ?n)(empty ?n))
  :effect (and (player-at ?p ?t)(not (player-at ?p ?f))(box-at ?b ?n)(not (box-at ?b ?t))(empty ?f)(not (empty ?n)))
 )
)

; problem
(define (problem sokoban1)
 (:domain sokoban)
 (:objects player1 - player
 box0 - box
 p1_1 p1_3 p1_4 p1_5 p1_6 p2_1 p2_3 p2_4 p2_5 p2_6 p3_1 p3_3 p3_4 p3_5 p3_6 p4_1 p4_2 p4_3 p4_4 p4_5 p4_6 p5_1 p5_2 p5_3 p5_4 p5_5 p5_6 - position)
 (:init
 (player-at player1 p1_1)
 (box-at box0 p2_3)
 (goal box0 p2_1)
 (adj-down p1_1 p2_1)
 (empty p1_3)
 (adj-down p1_3 p2_3)
 (adj-right p1_3 p1_4)
 (empty p1_4)
 (adj-down p1_4 p2_4)
 (adj-left p1_4 p1_3)
 (adj-right p1_4 p1_5)
 (empty p1_5)
 (adj-down p1_5 p2_5)
 (adj-left p1_5 p1_4)
 (adj-right p1_5 p1_6)
 (empty p1_6)
 (adj-down p1_6 p2_6)
 (adj-left p1_6 p1_5)
 (empty p2_1)
 (adj-up p2_1 p1_1)
 (adj-down p2_1 p3_1)
 (adj-up p2_3 p1_3)
 (adj-down p2_3 p3_3)
 (adj-right p2_3 p2_4)
 (empty p2_4)
 (adj-up p2_4 p1_4)
 (adj-down p2_4 p3_4)
 (adj-left p2_4 p2_3)
 (adj-right p2_4 p2_5)
 (empty p2_5)
 (adj-up p2_5 p1_5)
 (adj-down p2_5 p3_5)
 (adj-left p2_5 p2_4)
 (adj-right p2_5 p2_6)
 (empty p2_6)
 (adj-up p2_6 p1_6)
 (adj-down p2_6 p3_6)
 (adj-left p2_6 p2_5)
 (empty p3_1)
 (adj-up p3_1 p2_1)
 (adj-down p3_1 p4_1)
 (empty p3_3)
 (adj-up p3_3 p2_3)
 (adj-down p3_3 p4_3)
 (adj-right p3_3 p3_4)
 (empty p3_4)
 (adj-up p3_4 p2_4)
 (adj-down p3_4 p4_4)
 (adj-left p3_4 p3_3)
 (adj-right p3_4 p3_5)
 (empty p3_5)
 (adj-up p3_5 p2_5)
 (adj-down p3_5 p4_5)
 (adj-left p3_5 p3_4)
 (adj-right p3_5 p3_6)
 (empty p3_6)
 (adj-up p3_6 p2_6)
 (adj-down p3_6 p4_6)
 (adj-left p3_6 p3_5)
 (empty p4_1)
 (adj-up p4_1 p3_1)
 (adj-down p4_1 p5_1)
 (adj-right p4_1 p4_2)
 (empty p4_2)
 (adj-down p4_2 p5_2)
 (adj-left p4_2 p4_1)
 (adj-right p4_2 p4_3)
 (empty p4_3)
 (adj-up p4_3 p3_3)
 (adj-down p4_3 p5_3)
 (adj-left p4_3 p4_2)
 (adj-right p4_3 p4_4)
 (empty p4_4)
 (adj-up p4_4 p3_4)
 (adj-down p4_4 p5_4)
 (adj-left p4_4 p4_3)
 (adj-right p4_4 p4_5)
 (empty p4_5)
 (adj-up p4_5 p3_5)
 (adj-down p4_5 p5_5)
 (adj-left p4_5 p4_4)
 (adj-right p4_5 p4_6)
 (empty p4_6)
 (adj-up p4_6 p3_6)
 (adj-down p4_6 p5_6)
 (adj-left p4_6 p4_5)
 (empty p5_1)
 (adj-up p5_1 p4_1)
 (adj-right p5_1 p5_2)
 (empty p5_2)
 (adj-up p5_2 p4_2)
 (adj-left p5_2 p5_1)
 (adj-right p5_2 p5_3)
 (empty p5_3)
 (adj-up p5_3 p4_3)
 (adj-left p5_3 p5_2)
 (adj-right p5_3 p5_4)
 (empty p5_4)
 (adj-up p5_4 p4_4)
 (adj-left p5_4 p5_3)
 (adj-right p5_4 p5_5)
 (empty p5_5)
 (adj-up p5_5 p4_5)
 (adj-left p5_5 p5_4)
 (adj-right p5_5 p5_6)
 (empty p5_6)
 (adj-up p5_6 p4_6)
 (adj-left p5_6 p5_5)
 )
 (:goal (and
 (box-at box0 p2_1)
 ))
)

; plan
1. (move player1 p1_1 p2_1)
   deleted: (player-at player1 p1_1) (empty p2_1)
   added: (player-at player1 p2_1) (empty p1_1)
   goals met: 0 of 1
2. (move player1 p2_1 p3_1)
   deleted: (player-at player1 p2_1) (empty p3_1)
   added: (player-at player1 p3_1) (empty p2_1)
   goals met: 0 of 1
3. (move player1 p3_1 p4_1)
   deleted: (player-at player1 p3_1) (empty p4_1)
   added: (player-at player1 p4_1) (empty p3_1)
   goals met: 0 of 1
4. (move player1 p4_1 p4_2)
   deleted: (player-at player1 p4_1) (empty p4_2)
   added: (player-at player1 p4_2) (empty p4_1)
   goals met: 0 of 1
5. (move player1 p4_2 p4_3)
   deleted: (player-at player1 p4_2) (empty p4_3)
   added: (player-at player1 p4_3) (empty p4_2)
   goals met: 0 of 1
6. (move player1 p4_3 p3_3)
   deleted: (player-at player1 p4_3) (empty p3_3)
   added: (player-at player1 p3_3) (empty p4_3)
   goals met: 0 of 1
7. (move player1 p3_3 p3_4)
   deleted: (player-at player1 p3_3) (empty p3_4)
   added: (player-at player1 p3_4) (empty p3_3)
   goals met: 0 of 1
8. (move player1 p3_4 p2_4)
   deleted: (player-at player1 p3_4) (empty p2_4)
   added: (player-at player1 p2_4) (empty p3_4)
   goals met: 0 of 1
9. (move player1 p2_4 p1_4)
   deleted: (player-at player1 p2_4) (empty p1_4)
   added: (player-at player1 p1_4) (empty p2_4)
   goals met: 0 of 1
10. (move player1 p1_4 p1_3)
   deleted: (player-at player1 p1_4) (empty p1_3)
   added: (player-at player1 p1_3) (empty p1_4)
   goals met: 0 of 1
11. (push-down player1 box0 p1_3 p2_3 p3_3)
   deleted: (player-at player1 p1_3) (box-at box0 p2_3) (empty p3_3)
   added: (player-at player1 p2_3) (box-at box0 p3_3) (empty p1_3)
   goals met: 0 of 1
12. (push-down player1 box0 p2_3 p3_3 p4_3)
   deleted: (player-at player1 p2_3) (box-at box0 p3_3) (empty p4_3)
   added: (player-at player1 p3_3) (box-at box0 p4_3) (empty p2_3)
   goals met: 0 of 1
13. (move player1 p3_3 p3_4)
   deleted: (player-at player1 p3_3) (empty p3_4)
   added: (player-at player1 p3_4) (empty p3_3)
   goals met: 0 of 1
14. (move player1 p3_4 p4_4)
   deleted: (player-at player1 p3_4) (empty p4_4)
   added: (player-at player1 p4_4) (empty p3_4)
   goals met: 0 of 1
15. (push-left player1 box0 p4_4 p4_3 p4_2)
   deleted: (player-at player1 p4_4) (box-at box0 p4_3) (empty p4_2)
   added: (player-at player1 p4_3) (box-at box0 p4_2) (empty p4_4)
   goals met: 0 of 1
16. (push-left player1 box0 p4_3 p4_2 p4_1)
   deleted: (player-at player1 p4_3) (box-at box0 p4_2) (empty p4_1)
   added: (player-at player1 p4_2) (box-at box0 p4_1) (empty p4_3)
   goals met: 0 of 1
17. (move player1 p4_2 p5_2)
   deleted: (player-at player1 p4_2) (empty p5_2)
   added: (player-at player1 p5_2) (empty p4_2)
   goals met: 0 of 1
18. (move player1 p5_2 p5_1)
   deleted: (player-at player1 p5_2) (empty p5_1)
   added: (player-at player1 p5_1) (empty p5_2)
   goals met: 0 of 1
19. (push-up player1 box0 p5_1 p4_1 p3_1)
   deleted: (player-at player1 p5_1) (box-at box0 p4_1) (empty p3_1)
   added: (player-at player1 p4_1) (box-at box0 p3_1) (empty p5_1)
   goals met: 0 of 1
20. (push-up player1 box0 p4_1 p3_1 p2_1)
   deleted: (player-at player1 p4_1) (box-at box0 p3_1) (empty p2_1)
   added: (player-at player1 p3_1) (box-at box0 p2_1) (empty p4_1)
   goals met: 1 of 1
